Revit 2026 API

# TextNoteAddLeader Method

---

Adds a leader to the text note.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Leader AddLeader(
	TextNoteLeaderTypes leaderType
)
```
```vb
Public Function AddLeader (
	leaderType As TextNoteLeaderTypes
) As Leader
```
```cpp
public:
Leader^ AddLeader(
	TextNoteLeaderTypes leaderType
)
```
```fsharp
member AddLeader :
        leaderType : TextNoteLeaderTypes -> Leader
```

#### Parameters

leaderType TextNoteLeaderTypes
     Type of the leader being added.

#### Return Value

Leader The newly added leader.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

If the geometric type of the new leader (line vs arc.) differs from the type of existing leaders, then the type of the existing leaders will be changed to match the type of the newly created leader.

#### Reference

TextNote Class

Autodesk.Revit.DB Namespace